{"config": {"layers": [{"config": {"batch_input_shape": [null, 140, 5], "dtype": "float32", "name": "input_15", "sparse": false}, "name": "input_15", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "conv1d_29", "activation": "relu", "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "padding": "valid", "strides": [1], "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [8], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "conv1d_29", "class_name": "Conv1D", "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling1d_29", "pool_size": [2], "strides": [2], "trainable": true}, "name": "max_pooling1d_29", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_29", 0, 0, {}]]]}, {"config": {"name": "dropout_57", "rate": 0.25, "trainable": true}, "name": "dropout_57", "class_name": "Dropout", "inbound_nodes": [[["max_pooling1d_29", 0, 0, {}]]]}, {"config": {"name": "conv1d_30", "activation": "relu", "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "padding": "valid", "strides": [1], "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [8], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "conv1d_30", "class_name": "Conv1D", "inbound_nodes": [[["dropout_57", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling1d_30", "pool_size": [2], "strides": [2], "trainable": true}, "name": "max_pooling1d_30", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"config": {"name": "dropout_58", "rate": 0.25, "trainable": true}, "name": "dropout_58", "class_name": "Dropout", "inbound_nodes": [[["max_pooling1d_30", 0, 0, {}]]]}, {"config": {"merge_mode": "concat", "name": "bidirectional_15", "layer": {"config": {"name": "lstm_15", "go_backwards": false, "activity_regularizer": null, "return_state": false, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 0, "trainable": true, "activation": "tanh", "units": 16, "return_sequences": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false}, "class_name": "LSTM"}, "trainable": true}, "name": "bidirectional_15", "class_name": "Bidirectional", "inbound_nodes": [[["dropout_58", 0, 0, {}]]]}, {"config": {"name": "dropout_59", "rate": 0.25, "trainable": true}, "name": "dropout_59", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_15", 0, 0, {}]]]}, {"config": {"name": "flatten_15", "trainable": true}, "name": "flatten_15", "class_name": "Flatten", "inbound_nodes": [[["dropout_59", 0, 0, {}]]]}, {"config": {"name": "dense_29", "activation": "relu", "units": 256, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true}, "name": "dense_29", "class_name": "Dense", "inbound_nodes": [[["flatten_15", 0, 0, {}]]]}, {"config": {"name": "dropout_60", "rate": 0.25, "trainable": true}, "name": "dropout_60", "class_name": "Dropout", "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"config": {"name": "dense_30", "activation": "softmax", "units": 2, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true}, "name": "dense_30", "class_name": "Dense", "inbound_nodes": [[["dropout_60", 0, 0, {}]]]}], "output_layers": [["dense_30", 0, 0]], "name": "model_15", "input_layers": [["input_15", 0, 0]]}, "keras_version": "2.0.5", "class_name": "Model", "backend": "tensorflow"}
