{"config": {"output_layers": [["dense_12", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 140, 5], "dtype": "float32", "sparse": false, "name": "input_6"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_6"}, {"config": {"filters": 32, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [8], "activity_regularizer": null, "strides": [1], "name": "conv1d_11"}, "class_name": "Conv1D", "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv1d_11"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_11", "strides": [2], "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "name": "max_pooling1d_11"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_21"}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]], "name": "dropout_21"}, {"config": {"filters": 32, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [8], "activity_regularizer": null, "strides": [1], "name": "conv1d_12"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout_21", 0, 0, {}]]], "name": "conv1d_12"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_12", "strides": [2], "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_12", 0, 0, {}]]], "name": "max_pooling1d_12"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_22"}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling1d_12", 0, 0, {}]]], "name": "dropout_22"}, {"config": {"layer": {"config": {"unroll": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activation": "tanh", "return_state": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_constraint": null, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "units": 16, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_6"}, "class_name": "Bidirectional", "inbound_nodes": [[["dropout_22", 0, 0, {}]]], "name": "bidirectional_6"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_23"}, "class_name": "Dropout", "inbound_nodes": [[["bidirectional_6", 0, 0, {}]]], "name": "dropout_23"}, {"config": {"trainable": true, "name": "flatten_6"}, "class_name": "Flatten", "inbound_nodes": [[["dropout_23", 0, 0, {}]]], "name": "flatten_6"}, {"config": {"activation": "relu", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 256, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_11"}, "class_name": "Dense", "inbound_nodes": [[["flatten_6", 0, 0, {}]]], "name": "dense_11"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_24"}, "class_name": "Dropout", "inbound_nodes": [[["dense_11", 0, 0, {}]]], "name": "dropout_24"}, {"config": {"activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 2, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_12"}, "class_name": "Dense", "inbound_nodes": [[["dropout_24", 0, 0, {}]]], "name": "dense_12"}], "input_layers": [["input_6", 0, 0]], "name": "model_6"}, "class_name": "Model", "keras_version": "2.0.5", "backend": "tensorflow"}
